<h1 class="display-4"><b>ЧаВо</b></h1>
 
 <h4>Ошибка "content" на странице "Картинки"</h4>
 <p>Напишите вашу версию браузера в "Гостевую книгу", также некоторые файлы отсутствуют.</p>
 <h4>Сайт тормозит</h4>
 <p>Скорее всего проблема у вас, чаще всего нехватка оперативной памяти либо у нас проблемы с сервером.</p>
 <h4>Сайт некорректно отображается</h4>
 <p>На сайте есть 2 версии:<br>  1. Упрощенная<br>  2. Обычная<br>Она выбирается автоматически в зависимости от вашего браузера. Поддерживаются Chrome 81 и выше, Safari 12 и выше, Opera 72 и выше. Это связано с использованием <a href="https://caniuse.com/css-filters">CSS фильтров</a>. Также скиньте кеш браузера, такое бывает после обновления сайта или отключены куки.</p>
 <h4>Не работает тёмная тема</h4>
 <p>У вас отключены куки. Если не так, тогда пишите в гостевую книгу ваш браузер и устройство.</p>
 <h4>Ошибка "content" на странице "Главная"</h4>
 <p>Скорее всего проблемы с нашим сервером. Если вы с ПК нажмите F12 и напишите в гостевой ошибку (чащё всего 404, 500, 502, 503) и название файла.</p>
 <h4>Ошибка "content" на странице поста.</h4>
 <p>Бывает падает сервер с фулл картинками. Просто подождите около 5 минут.</p>
