  <h1 class="display-4"><b>Спасибо</b></h1>
  <p>Большое спасибо Ycea за парсинг картинок и помощи в написании некоторых JS скриптов.</p>
  <p>Если есть желающие помочь с развитием сайта, пожалуйста пишите на почту:<b> <a class="<?php if($darkmode=="true"){echo "text-light";} else{echo "text-dark";}?>" href="mailto:info.harhive@gmail.com">info.harhive@gmail.com</a> </b><br>Также обязательно нужно уметь работать с html, CSS, php и знать основы JavaScript.</p>

  <h1 class="display-4"><b>Поддержать</b></h1>

  <p>Лучший способ поддержать сайт это не помочь материально, а сделать что-то для него. Также сайт использует только свои источники для изображений. </p>

  <p><b>Планы 1.1:</b></p>
  <p>- <strike>Удалить страницу Обои.</strike> (придумать что-то другое)<br>
     - Добавить избранные картинки.<br>
     - Добавить новый вид просмотра картинок.<br>
     - <strike>Добавить раздел Архивы и дать возможность каждому добавлять.</strike> (не будет)<br>
     - <strike>Переделать оповещение о неверно заполненных полях.</strike> (1.03)<br>
     - <strike>Сделать авто подгрузку изображений, когда доходишь до конца страницы.</strike> (1.02)<br>
     - <strike>Больше сжать картинки и улучшить производительность.</strike> (1.02)<br>
     - <strike>Исправить баг с переключением темы.</strike> (1.01)<br>
     </p>
  <p><b>Планы 1.2:</b></p>
  <p>- <strike>Переделать уведомления на <a href="https://bootstrap-4.ru/docs/4.5/components/toasts/" class="link">Toasts</a>.</strike> (1.03) <br>
     - Немного доделать дизайн.<br>
     - Сделать тему с помощью js.<br>
     </p>

  <p><b>Список изменений:</b></p>
  <p><b>1.02->1.04</b><br>
     - Новые уведомления. <br>
     - Переход на старую базу картинок в пункте "Обои" (Сейчас "Картинки"), переход связан с ошибкой 1020. <br>
     - Фикс скорости анимации. <br>
     - Убрана желтая обводка в кнопки меню на мобильных устройствах. <br></p>
  <p><b>1.0->1.02</b><br>
     - Фикс багов <br>
     - Улучшение безопасности сайта <br>
     - Выбор темы сайта <br>
     - Оптимизация <br>  </p>
  <p><b>0.91->1.0</b><br>
     - Новый логотип, а также немного изменён дизайн сайта<br>
     - Добавлена тёмная тема <strike>(включается автоматически)</strike><br>
     - Добавлены новые картинки (<strike>Днём и ночью разные</strike> скоро завезём)<br>
     - Добавлены иконки на кнопках<br>
     - Собственые сервера для картинок<br>
     - Исправлена проблема с Https подключением, когда не грузились картинки<br>
     - Изменены уведомления, которые теперь можно закрыть раз и они больше не будут появляться некоторое время. <br>
     - Небольшой редизайн навигации, фикс бага когда пункты некорректно отображались<br>
     - Исправлен баг в гостевой странице с повторной отправкой формы при обновлении страницы<br>
     - Убрана уязвимость от html тегов и пустых комментариев<br>
     - Новые комментарии появляется сверху<br>
     - Два раза полностью пересобирался бек сайта<br>
     - Другие улучшения и фиксы       </p>

  


  <p><br><code>Version 1.06</code></p>
