  <h1 class="display-4"><b>Спасибо</b></h1>
  <p>Большое спасибо Ycea за парсинг картинок и помощи в написании некоторых JS скриптов.</p>
  <p>Если есть желающие помочь с развитием сайта, пожалуйста пишите на почту:<b> <a class="<?php if($darkmode=="true"){echo "text-light";} else{echo "text-dark";}?>" href="mailto:info.harhive@gmail.com">info.harhive@gmail.com</a> </b><br>Также обязательно нужно уметь работать с html, CSS, php и знать основы JavaScript.</p>

  <h1 class="display-4"><b>Поддержать</b></h1>

  <p>Лучший способ поддержать сайт это не помочь материально, а сделать что-то для него. Также сайт использует только свои источники для изображений. </p>
  <center>
        <a href="https://github.com/bot08/Harhive" type="button" class="btn shadow p-2 mb-4 button <?php if ($darkmode=="true"){echo "btn-danger";} else{echo "btn-light";} ?>"><svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class="bi bi-github" viewBox="0 0 16 16"> <path d="M8 0C3.58 0 0 3.58 0 8c0 3.54 2.29 6.53 5.47 7.59.4.07.55-.17.55-.38 0-.19-.01-.82-.01-1.49-2.01.37-2.53-.49-2.69-.94-.09-.23-.48-.94-.82-1.13-.28-.15-.68-.52-.01-.53.63-.01 1.08.58 1.23.82.72 1.21 1.87.87 2.33.66.07-.52.28-.87.51-1.07-1.78-.2-3.64-.89-3.64-3.95 0-.87.31-1.59.82-2.15-.08-.2-.36-1.02.08-2.12 0 0 .67-.21 2.2.82.64-.18 1.32-.27 2-.27.68 0 1.36.09 2 .27 1.53-1.04 2.2-.82 2.2-.82.44 1.1.16 1.92.08 2.12.51.56.82 1.27.82 2.15 0 3.07-1.87 3.75-3.65 3.95.29.25.54.73.54 1.48 0 1.07-.01 1.93-.01 2.2 0 .21.15.46.55.38A8.012 8.012 0 0 0 16 8c0-4.42-3.58-8-8-8z"/> </svg> GitHub</a>
  </center>

  <p><b>Планы 1.1:</b></p>
  <p>- <strike>Удалить страницу Обои.</strike> (придумать что-то другое)<br>
     - Добавить избранные картинки.<br>
     - Добавить новый вид просмотра картинок.<br>
     - <strike>Добавить раздел Архивы и дать возможность каждому добавлять.</strike> (не будет)<br>
     - <strike>Переделать оповещение о неверно заполненных полях.</strike> (1.03)<br>
     - <strike>Сделать авто подгрузку изображений, когда доходишь до конца страницы.</strike> (1.02)<br>
     - <strike>Больше сжать картинки и улучшить производительность.</strike> (1.02)<br>
     - <strike>Исправить баг с переключением темы.</strike> (1.01)<br>
     </p>
  <p><b>Планы 1.2:</b></p>
  <p>- <strike>Переделать уведомления на <a href="https://bootstrap-4.ru/docs/4.5/components/toasts/" class="link">Toasts</a>.</strike> (1.03) <br>
     - Немного доделать дизайн.<br>
     - Сделать тему с помощью js.<br>
     </p>

  <p><b>Список изменений:</b></p>
  <p><b>1.04->1.07</b><br>
     - Добавлен режим переходу к странице. <br>
     - Сильнее сжаты картинки. <br>
     - Работа со стилями сайта. <br>
     - Фикс багов. <br>  </p>
  <p><b>1.02->1.04</b><br>
     - Новые уведомления. <br>
     - Переход на старую базу картинок в пункте "Обои" (Сейчас "Картинки"), переход связан с ошибкой 1020. <br>
     - Фикс скорости анимации. <br>
     - Убрана желтая обводка в кнопки меню на мобильных устройствах. <br></p>
  <p><b>1.0->1.02</b><br>
     - Фикс багов. <br>
     - Улучшение безопасности сайта. <br>
     - Выбор темы сайта. <br>
     - Оптимизация. <br>  </p>
  <p><b>0.91->1.0</b><br>
     - Новый логотип, а также немного изменён дизайн сайта<br>
     - Добавлена тёмная тема <strike>(включается автоматически)</strike><br>
     - Добавлены новые картинки (<strike>Днём и ночью разные</strike> скоро завезём)<br>
     - Добавлены иконки на кнопках<br>
     - Собственые сервера для картинок<br>
     - Исправлена проблема с Https подключением, когда не грузились картинки<br>
     - Изменены уведомления, которые теперь можно закрыть раз и они больше не будут появляться некоторое время. <br>
     - Небольшой редизайн навигации, фикс бага когда пункты некорректно отображались<br>
     - Исправлен баг в гостевой странице с повторной отправкой формы при обновлении страницы<br>
     - Убрана уязвимость от html тегов и пустых комментариев<br>
     - Новые комментарии появляется сверху<br>
     - Два раза полностью пересобирался бек сайта<br>
     - Другие улучшения и фиксы       </p>

  


  <p><br><code>Version 1.08</code></p>
